package com.kh.chap01_abstraction.run;

import com.kh.chap01_abstraction.model.vo.Student;

public class AbstractionRun {

	/*
	 * 1. 객체지향언어 : "객체"를 "지향"하는 언어로 "객체 중심"으로 돌아간다고 생각하면 됨.
	 * 
	 * 2. 객체란 : 현실세계에 독립적으로 존재 (목적이 있고 가치가 있고 의미가 있는) 하는 모든 것들을 의미(유형, 무형, 개념,...)
	 * 			현실세계에서는 객체들간의 상호작용으로 돌아감
	 * 
	 * 3. 객체지향 프로그래밍 : 현실세계의 객체들간의 상호작용
	 * 					   프로그래밍을 통해 가상세계로 구현하는 과정
	 * 
	 * 4. 구현하고자 하는 프로그램상 필요한 객체들을 만들기 위해서 (즉, 생성하기 위해서)
	 * 		: 클래스라는 틀을 먼저 말들어야 됨!! (클래스 : 각 객체들의 속성(정보)들을 담아낼 그릇 같은 존재) => 이름, 나이, 주소, 휴대폰번호 등을 담을 수 있는 그릇
	 * 		>> 어떻게 만드는 걸까? 추상화 + 캡슐화 접목해서 만들어야함!!
	 * 
	 * 5. 추상화 과정
	 * 	1) 내가 구현하고자 하는 프로그램에서 필요한 객체들을 생각해 볼 것 => 쇼핑몰
	 * 	2) 그 객체들이 가지는 공통적인 속성, 기능들을 모두 추출 => 이름, 나이, 주소, 휴대폰번호, mbti, 혈액형 ...
	 * 	3) 추출한 것들을 가지고 
	 * 
	 * 
	 * ... 나중에정리하자
	 * 
	 */
	
	public static void main(String[] args) {

		// 클래스를 만든 후 학생 객체 만들어보기
		
		// 자바에서의 객체로 만들기 위해서 new 라는 키워드를 통해 Heap영역에 생성먼저 해야딤!! (공간할당)
		
		Student woo = new Student(); //  객체 생성 구문
		
		
		
		
		
		
	}

}
